# itgid.info - python 2023

# Напишите код, который заменяет в m11 с индексом 1 на число 1000 без удаления исходных данных. Выведите в консоль.

# write your code under this line

m11 = [999, 888]

m11[1] = 1000

print(m11)